In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
#Column이 한개인 데이터 프레임 생성, Values = 0,1,2,3 , index = 'd','a','b','c'
obj = Series(range(4), index = ['d','a', 'b', 'c'])
print(obj)

d    0
a    1
b    2
c    3
dtype: int64

In [5]:
# 적은 index 순으로 정렬_value와 Index 함께

obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [6]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [8]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'], columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [9]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [11]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [12]:
frame.sort_index(axis = 1, ascending = False) # 내림차순 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [14]:
frame.sort_index(axis =1 , ascending =True)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [18]:
frame = DataFrame({'b':[4,7,3,2], 'a' : [4,9,2,5], 'c':[5,3,7,9]})#, index=['q','w','e','r'])
frame

   b  a  c
0  4  4  5
1  7  9  3
2  3  2  7
3  2  5  9

In [21]:
frame.sort_values(by='b')#.sort_values(by = n) -  n열을 기준으로 정렬

   b  a  c
3  2  5  9
2  3  2  7
0  4  4  5
1  7  9  3

In [22]:
frame.sort_values(by = 'a')

   b  a  c
2  3  2  7
0  4  4  5
3  2  5  9
1  7  9  3

In [23]:
#순위 매기기 rank 기본값으로 오름차순 순위를 출력
obj = Series([100,23,55,44,22,99,33])
obj.rank()

0    7.0
1    2.0
2    5.0
3    4.0
4    1.0
5    6.0
6    3.0
dtype: float64

In [29]:
obj = Series([100,23,55,44,22,99,33])
obj.rank(ascending = False) #내림차순

0    1.0
1    6.0
2    3.0
3    4.0
4    7.0
5    2.0
6    5.0
dtype: float64

In [33]:
#동점_평균값으로 랭크를 매김 : 우선순위 합 / n개
obj = Series([100,23,100,44,22,99,33])
obj.rank()

0    6.5
1    2.0
2    6.5
3    4.0
4    1.0
5    5.0
6    3.0
dtype: float64

In [34]:
#동일값은 존재하는데 먼저 나타난 경우에 우선순위를 주는 경우
obj.rank(method='first')

0    6.0
1    2.0
2    7.0
3    4.0
4    1.0
5    5.0
6    3.0
dtype: float64

In [35]:
frame = DataFrame({'b':[4,7,3,2], 'a':[4,9,2,5], 'c':[5,3,7,9]})
frame

   b  a  c
0  4  4  5
1  7  9  3
2  3  2  7
3  2  5  9

In [36]:
frame.rank(axis = 1) #0행 - 우선순위 (1 + 2) / 2  = 1.5

     b    a    c
0  1.5  1.5  3.0
1  2.0  3.0  1.0
2  2.0  1.0  3.0
3  1.0  2.0  3.0

In [38]:
#NaN이 있는 경우 빼고 계산
frame = DataFrame({'b':[4,7,3,2], 'a':[4,9,2,5], 'c':[5,3,7,np.nan]})

frame

   b  a    c
0  4  4  5.0
1  7  9  3.0
2  3  2  7.0
3  2  5  NaN

In [39]:
frame.sum() #sum()은 NaN을 빼고 계산_열

b    16.0
a    20.0
c    15.0
dtype: float64

In [40]:
frame.mean() #mean()은 평균을 구함 NaN을 빼고 계산_열

b    4.0
a    5.0
c    5.0
dtype: float64

In [41]:
#NaN을 반영
#skipna => skip NaN을 뜻함
frame.sum(skipna = False)

b    16.0
a    20.0
c     NaN
dtype: float64

In [46]:
#최대치 위치 반환
frame.idxmax()

b    1
a    1
c    2
dtype: int64

In [47]:
#최소값 위치 반환
frame.idxmin()

b    3
a    2
c    1
dtype: int64

In [48]:
#항목 수 및 유니크값 찾기
obj = Series(['c','a','d','a','a','b','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [49]:
obj.unique()#value의 종류 확인

array(['c', 'a', 'd', 'b'], dtype=object)

In [50]:
obj.value_counts() #빈도수 확인 _ 높은순부터

c    3
a    3
b    2
d    1
dtype: int64

In [51]:
obj.value_counts(sort = False) #빈도수 확인 _ 순서 상관없이

a    3
c    3
d    1
b    2
dtype: int64

In [52]:
# 특정 내용이 있는지 확인
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [54]:
obj[mask] #obj에서 mask가 참인 값만 출력

0    c
5    b
6    b
7    c
8    c
dtype: object

In [55]:
obj[obj.isin(['b','c'])] #위와 같은 값

0    c
5    b
6    b
7    c
8    c
dtype: object

In [57]:
frame = DataFrame({'X':['c','a','d','a','a','b','b','c','c'],
                  'Y':['f','g','d','g','h','e','d','h','f'],
                  'Z':['a','e','d','g','d','e','q','b','c']})

frame

   X  Y  Z
0  c  f  a
1  a  g  e
2  d  d  d
3  a  g  g
4  a  h  d
5  b  e  e
6  b  d  q
7  c  h  b
8  c  f  c

In [59]:
# 각 항목 빈도 수
result = frame.apply(pd.value_counts)
result

     X    Y    Z
a  3.0  NaN  1.0
b  2.0  NaN  1.0
c  3.0  NaN  1.0
d  1.0  2.0  2.0
e  NaN  1.0  2.0
f  NaN  2.0  NaN
g  NaN  2.0  1.0
h  NaN  2.0  NaN
q  NaN  NaN  1.0

In [61]:
result = frame.apply(pd.value_counts).fillna(0)
result

     X    Y    Z
a  3.0  0.0  1.0
b  2.0  0.0  1.0
c  3.0  0.0  1.0
d  1.0  2.0  2.0
e  0.0  1.0  2.0
f  0.0  2.0  0.0
g  0.0  2.0  1.0
h  0.0  2.0  0.0
q  0.0  0.0  1.0

TypeError: apply() missing 1 required positional argument: 'func'